# 점자 문장에 대해 클릭 수 계산
def calculate_click(phrase):
    braille_to_click = [[1, 2, 4, 8, 16, 32],
                        [3, 5, 6, 9, 10, 12, 17, 18, 20, 24,
                         33, 34, 36, 40, 48],
                        [7, 11, 13, 14, 19, 21, 22, 25, 26, 28,
                         35, 37, 38, 41, 42, 44, 49, 50, 52, 56],
                        [15, 23, 27, 29, 30, 39, 43, 45, 46, 51,
                         53, 54, 57, 58, 60],
                        [31, 47, 55, 59, 61, 62],
                        [63]]
    cnt = 0
    for c in phrase:
        n = ord(c) - 0x2800
        for i in range(6):
            if n in braille_to_click[i]:
                cnt += i + 1
    return cnt
